In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("met_eireann_historical_without_header.csv")

C:\Users\milob\Anaconda3\envs\research-project\lib\site-packages\IPython\core\interactiveshell.py:3063: DtypeWarning: Columns (4,6,7,8,9,10) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
data.dtypes

date     object
ind       int64
rain     object
ind.1     int64
temp     object
ind.2     int64
wetb     object
dewpt    object
vappr    object
rhum     object
msl      object
dtype: object

date:  -  Date and Time (utc)<br>
rain:  -  Precipitation Amount (mm)<br>  
temp:  -  Air Temperature (C)<br>	
wetb:  -  Wet Bulb Temperature (C)<br>
dewpt: -  Dew Point Temperature (C)<br>
vappr: -  Vapour Pressure (hPa)	<br>	                 
rhum:  -  Relative Humidity (%) <br>
msl:   -  Mean Sea Level Pressure (hPa)<br>
ind:   -  Indicator

In [4]:
data.head()

,date,ind,rain,ind.1,temp,ind.2,wetb,dewpt,vappr,rhum,msl
0,01-may-2005 01:00,0,0.0,0,9.1,0,8.8,8.5,11.1,96,1005.7
1,01-may-2005 02:00,0,0.1,0,9.6,0,9.3,9.0,11.5,95,1004.8
2,01-may-2005 03:00,0,0.0,0,10.0,0,9.7,9.3,11.7,95,1003.5
3,01-may-2005 04:00,0,0.0,0,10.1,0,9.8,9.4,11.8,95,1002.8
4,01-may-2005 05:00,0,0.0,0,10.2,0,9.8,9.4,11.8,94,1002.2

In [5]:
data.tail()

,date,ind,rain,ind.1,temp,ind.2,wetb,dewpt,vappr,rhum,msl
120139,31-may-2020 20:00,0,0.0,0,16.6,0,12.4,8.5,11.1,58,1023.5
120140,31-may-2020 21:00,0,0.0,0,13.5,0,11,8.6,11.2,72,1024
120141,31-may-2020 22:00,0,0.0,0,12.2,0,10.4,8.6,11.2,78,1024.2
120142,31-may-2020 23:00,0,0.0,0,11.5,0,10.2,8.8,11.3,83,1024.1
120143,01-jun-2020 00:00,0,0.0,0,10.7,0,9.6,8.5,11.1,86,1024.2

In [6]:
data.shape

(120144, 11)

In [7]:
# convert date into timestamp & select only relevant year
data["date"] = pd.to_datetime(data["date"])

In [8]:
data.head()

,date,ind,rain,ind.1,temp,ind.2,wetb,dewpt,vappr,rhum,msl
0,2005-05-01 01:00:00,0,0.0,0,9.1,0,8.8,8.5,11.1,96,1005.7
1,2005-05-01 02:00:00,0,0.1,0,9.6,0,9.3,9.0,11.5,95,1004.8
2,2005-05-01 03:00:00,0,0.0,0,10.0,0,9.7,9.3,11.7,95,1003.5
3,2005-05-01 04:00:00,0,0.0,0,10.1,0,9.8,9.4,11.8,95,1002.8
4,2005-05-01 05:00:00,0,0.0,0,10.2,0,9.8,9.4,11.8,94,1002.2

In [9]:
start_timestamp = pd.Timestamp(1514764800, unit="s")   # 01/01/2018 00:00:00
end_timestamp = pd.Timestamp(1546300800, unit="s")     # 01/01/2019 00:00:00

In [10]:
data = data[data["date"] >= start_timestamp]
data = data[data["date"] <= end_timestamp]

In [11]:
data.shape

(8761, 11)

In [12]:
data.head()

,date,ind,rain,ind.1,temp,ind.2,wetb,dewpt,vappr,rhum,msl
98975,2018-01-01 00:00:00,0,0.0,0,4.6,0,3.5,1.8,6.9,82,991
98976,2018-01-01 01:00:00,0,0.1,0,4.7,0,3.6,1.8,7,81,991.1
98977,2018-01-01 02:00:00,0,0.0,0,4.8,0,3.7,1.9,7,81,991.1
98978,2018-01-01 03:00:00,0,0.0,0,4.9,0,3.8,2.2,7.2,82,990.7
98979,2018-01-01 04:00:00,0,0.0,0,5.3,0,4.1,2.3,7.2,81,990.3

In [13]:
# find unique values by column
for col in data.columns:
    print("%s: %d" % (col, data[col].nunique()))

date: 8761
ind: 2
rain: 45
ind.1: 1
temp: 304
ind.2: 1
wetb: 243
dewpt: 257
vappr: 171
rhum: 76
msl: 584

In [14]:
data["ind"].value_counts()

 0    8759
-1       2
Name: ind, dtype: int64

In [15]:
data["ind.1"].value_counts()

0    8761
Name: ind.1, dtype: int64

In [16]:
data["ind.2"].value_counts()

0    8761
Name: ind.2, dtype: int64

In [17]:
data["rain"].max()

'8.6'

In [18]:
# check for null / missing values in the data
data.isnull().sum()

date     0
ind      0
rain     0
ind.1    0
temp     0
ind.2    0
wetb     0
dewpt    0
vappr    0
rhum     0
msl      0
dtype: int64

only interested in date, rainfall & temperature (for vallidation against other dataset) - drop all other features:<br>
    ind: uniform across all rows<br>
    ind.1: uniform across all rows<br>
    ind.2: uniform across all rows<br>
    wetb: wetbulb temp - think that actual temp & 'feels-like' temp are more important<br>
    dewpt: think umlikely that dewpoint wil affect travel times<br>
    vappr: think umlikely that vapour pressure wil affect travel times<br>
    rhum: think umlikely that relative humidity wil affect travel times<br>
    msl: think umlikely that mean-sea-level wil affect travel times<br>

In [19]:
data.drop(columns=["ind", "ind.1", "ind.2", "wetb", "dewpt", "vappr", "rhum", "msl"], inplace=True)

In [20]:
data.head()

                     date rain temp
98975 2018-01-01 00:00:00  0.0  4.6
98976 2018-01-01 01:00:00  0.1  4.7
98977 2018-01-01 02:00:00  0.0  4.8
98978 2018-01-01 03:00:00  0.0  4.9
98979 2018-01-01 04:00:00  0.0  5.3

In [21]:
data.dtypes

date    datetime64[ns]
rain            object
temp            object
dtype: object

In [22]:
# bind rain as type string
data["rain"].astype(str)
# bind temp as type string
data["temp"].astype(str)

t_0 = 0
r_0 = 0


for i in data.index:
    r = data.loc[i, "rain"]
    t = data.loc[i, "temp"]
    
    try:
        r_float = float(r.strip())
    except:
        try:
            r_float = float(r)
        except:
            print(r)
            r_float = 0
            r_0 += 1
    
    data.loc[i, "rain"] = r_float
    
    try:
        t_float = float(t.strip())
    except:
        try:
            t_float = float(t)
        except:
            print(t)
            t_float = 0
            t_0 += 1
    
    data.loc[i, "temp"] = t_float
    
print(r_0)
print(t_0)

2
0

The above code searches all values of "rain" and "temp" and replaces empty strings with "0"

In [24]:
# cast rain & temp as type float
data["temp"].astype(float)
data["rain"].astype(float)

98975     0.0
98976     0.1
98977     0.0
98978     0.0
98979     0.0
         ...
107731    0.0
107732    0.0
107733    0.0
107734    0.0
107735    0.0
Name: rain, Length: 8761, dtype: float64

In [26]:
# double check that all datetimes are unique
data["date"].nunique() == len(data["date"])

True

In [28]:
# save cleaned data
data.to_csv("met_eireann_historical_cleaned.csv", index=False)